from localization import _


what_emotion_do_you_feel_message = [
    _('Что ты сейчас чувствуешь?'),
    _('Какие чувства ты испытываешь в данный момент?'),
    _('Испытываешь ли ты сейчас какие-то сильные эмоции?'),
    _('Можешь ли ты описать свое эмоциональное состояние?'),
    _('Что происходит внутри тебя?'),
    _('Я чувствую, ты ощущаешь какие-то эмоции. Какие?'),
    _('Какие эмоции ты испытывал в течение последних нескольких минут или часов?'),
    _('Есть ли у тебя какие-то эмоции, которые ты обычно скрываешь, но которыми мог бы поделиться со мной?'),
    _('Ты можешь описать свое эмоциональное состояние в данный момент?'),
    _('Какие эмоции сейчас внутри тебя?'),
    _('Что происходит внутри тебя в данный момент?'),
    _('Как ты себя чувствуешь?'),
    _('Какие эмоции ты испытываешь в течение последних нескольких часов?'),
    _('Ты всегда можешь поделиться своими эмоциями со мной'),
    _('Что у тебя на душе?'),
    _('Что ты сейчас чувствуешь?'),
    _("Я всегда тут, чтобы выслушать, что ты чувствуешь"),
    _("Прислушайся к себе. Что ты чувствуешь?"),
    _("Обрати внимание на себя. Что ты ощущаешь?"),
]



choose_emotion_message = [_('Выбери эмоцию из списка или напиши свою:'),
]

select_multuple_if_you_want = _('Если ты испытываешь несколько эмоций одновременно, можешь отметить их все.')

what_emotion_do_you_feel_pt2_message = _('Дополнительный список эмоций:')

first_emotion_list_again_message = _("Основной список эмоций:")

write_own_emotion_message = _('Назови свою эмоцию самостоятельно')

which_intensity_message = _('Насколько интенсивно ты чувствуешь {emotion}?')

which_intensity_unknown_emotion_message = _('Насколько интенсивны твои эмоции?')

finish_positive_med_high_intensity_message = _("""Ты молодец, что уделяешь внимание своим эмоциям! """)


triggers_start_gather_message = _("""Отметь, что вызвало эту эмоцию? 
(Можно вписать свой вариант)""")

triggers_new_variant_message = _("""Впиши свой вариант""")

triggers_second_layer_message = _("""Уточни, что конкретно вызвало эту эмоцию?
(Можно вписать свой вариант)""")




triggers_finish_gather_message = _("""Когда ты отмечаешь триггеры, ты уделяешь внимание тому, откуда пришла эта эмоция. Продолжай в том же духе!""")
