from localization import _


onboarding_first_message = _("""👋 Привет, я Emphatix! 
Я помогу тебе отслеживать эмоции и причины их возникновения. Научу тебя замечать, распознавать и называть эмоции и причины, которые стоят за ними.
Внимание к себе и своим эмоциям позитивно влияет на личную жизнь и карьеру!""")

choose_gender = _("""Выбери пожалуйста свой пол""")

what_is_your_time_message = _("""Сколько у тебя сейчас часов? (Полных часов, например, при 15:43 надо отметить 15:00) 
Это нужно, чтобы выставить удобный график отправки сообщений.""")

how_often_to_ask_message = _("""Как часто у тебя спрашивать про то, что ты чувствуешь?
Отмечая эмоции хотя бы 3 раза в день, ты прокачиваешь своё распознавание эмоций за 4 недели почти в 2 раза!""")


choose_time_to_receive_message = _('Выбери, в какое время тебе будет удобно получать уведомления')
choose_at_least_1_variant_message = _("""Пожалуйста, выбери хотя бы 1 вариант ответа.""")


chosen_times_message = _('Выбранное время: {}.\n') + choose_time_to_receive_message

settings_updated_message = _('Настройки успешно обновлены!')


you_choose_message = _('\nВыбраны варианты: {}')


all_set_chosen_times_message = _("""🌿Всё готово!
Я буду присылать тебе {} сообщений в день, в которых буду спрашивать тебя о том, что ты чувствуешь и что вызывает эти эмоции. 
Давай отметим твою первую эмоцию!""")

all_set_no_chosen_times_message = _("""🌿Всё готово! 
Я не буду сам спрашивать, что ты чувствуешь, но всегда буду здесь, чтобы услышать об этом.
Давай отметим твою первую эмоцию!""")
