from localization import _

welcome_message = _("""👋Привет! Меня зовут Emphatix, помогу тебе отслеживать твои эмоции в течения дня. Это поможет тебе замечать, распознавать и понимать свои эмоции.""")


main_page_message = _("""Выбери опцию из меню ниже""")

main_after_no_emotion_message = _("""Я всегда буду ждать тебя здесь🤗""")


questionnaire_not_finished_message = _('\nПеред тем как начать работу с ботом, ответь, пожалуйста, на несколько вопросов в анкете ниже.')


bot_description_message = _("""👋 Привет, меня зовут Emphatix! 
Я помогу тебе отслеживать эмоции и причины их возникновения. Научу тебя замечать, распознавать и называть эмоции и причины, которые стоят за ними.
Внимание к себе и своим эмоциям позитивно влияет на личную жизнь и карьеру!

Автор: 
@sheptyakov""")

feedback_message = _("""Оставь свой фидбек в текстовой форме здесь: """)


feedback_saved_message = _("""Спасибо за обратную связь!""")


donations_message = _("""Если вы хотите поддержать проект, сделать это можно следующими способами: 

Тинькофф: 2200 7001 1609 2031

Revolut: @sheptyakov""")